MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFH100/mcu.h
extern volatile __C1FIFOINT29bits_t C1FIFOINT29bits __asm__ ("C1FIFOINT29") __attribute__((section("sfrs"), address(0xBF880AA0)));
extern volatile uint32_t        C1FIFOINT29CLR __attribute__((section("sfrs"),address(0xBF880AA4)));
extern volatile uint32_t        C1FIFOINT29SET __attribute__((section("sfrs"),address(0xBF880AA8)));
extern volatile uint32_t        C1FIFOINT29INV __attribute__((section("sfrs"),address(0xBF880AAC)));
#define C1FIFOUA29 C1FIFOUA29
extern volatile uint32_t   C1FIFOUA29 __attribute__((section("sfrs"), address(0xBF880AB0)));
extern volatile uint32_t        C1FIFOUA29CLR __attribute__((section("sfrs"),address(0xBF880AB4)));
extern volatile uint32_t        C1FIFOUA29SET __attribute__((section("sfrs"),address(0xBF880AB8)));
extern volatile uint32_t        C1FIFOUA29INV __attribute__((section("sfrs"),address(0xBF880ABC)));
#define C1FIFOCI29 C1FIFOCI29
extern volatile uint32_t   C1FIFOCI29 __attribute__((section("sfrs"), address(0xBF880AC0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI29bits_t;
extern volatile __C1FIFOCI29bits_t C1FIFOCI29bits __asm__ ("C1FIFOCI29") __attribute__((section("sfrs"), address(0xBF880AC0)));
extern volatile uint32_t        C1FIFOCI29CLR __attribute__((section("sfrs"),address(0xBF880AC4)));
extern volatile uint32_t        C1FIFOCI29SET __attribute__((section("sfrs"),address(0xBF880AC8)));
extern volatile uint32_t        C1FIFOCI29INV __attribute__((section("sfrs"),address(0xBF880ACC)));
#define C1FIFOCON30 C1FIFOCON30
extern volatile uint32_t   C1FIFOCON30 __attribute__((section("sfrs"), address(0xBF880AD0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON30bits_t;
extern volatile __C1FIFOCON30bits_t C1FIFOCON30bits __asm__ ("C1FIFOCON30") __attribute__((section("sfrs"), address(0xBF880AD0)));
extern volatile uint32_t        C1FIFOCON30CLR __attribute__((section("sfrs"),address(0xBF880AD4)));
extern volatile uint32_t        C1FIFOCON30SET __attribute__((section("sfrs"),address(0xBF880AD8)));
extern volatile uint32_t        C1FIFOCON30INV __attribute__((section("sfrs"),address(0xBF880ADC)));
#define C1FIFOINT30 C1FIFOINT30
extern volatile uint32_t   C1FIFOINT30 __attribute__((section("sfrs"), address(0xBF880AE0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT30bits_t;
extern volatile __C1FIFOINT30bits_t C1FIFOINT30bits __asm__ ("C1FIFOINT30") __attribute__((section("sfrs"), address(0xBF880AE0)));
extern volatile uint32_t        C1FIFOINT30CLR __attribute__((section("sfrs"),address(0xBF880AE4)));
extern volatile uint32_t        C1FIFOINT30SET __attribute__((section("sfrs"),address(0xBF880AE8)));
extern volatile uint32_t        C1FIFOINT30INV __attribute__((section("sfrs"),address(0xBF880AEC)));
#define C1FIFOUA30 C1FIFOUA30
extern volatile uint32_t   C1FIFOUA30 __attribute__((section("sfrs"), address(0xBF880AF0)));
extern volatile uint32_t        C1FIFOUA30CLR __attribute__((section("sfrs"),address(0xBF880AF4)));
extern volatile uint32_t        C1FIFOUA30SET __attribute__((section("sfrs"),address(0xBF880AF8)));
extern volatile uint32_t        C1FIFOUA30INV __attribute__((section("sfrs"),address(0xBF880AFC)));
#define C1FIFOCI30 C1FIFOCI30
extern volatile uint32_t   C1FIFOCI30 __attribute__((section("sfrs"), address(0xBF880B00)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI30bits_t;
extern volatile __C1FIFOCI30bits_t C1FIFOCI30bits __asm__ ("C1FIFOCI30") __attribute__((section("sfrs"), address(0xBF880B00)));
extern volatile uint32_t        C1FIFOCI30CLR __attribute__((section("sfrs"),address(0xBF880B04)));
extern volatile uint32_t        C1FIFOCI30SET __attribute__((section("sfrs"),address(0xBF880B08)));
extern volatile uint32_t        C1FIFOCI30INV __attribute__((section("sfrs"),address(0xBF880B0C)));
#define C1FIFOCON31 C1FIFOCON31
extern volatile uint32_t   C1FIFOCON31 __attribute__((section("sfrs"), address(0xBF880B10)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON31bits_t;
extern volatile __C1FIFOCON31bits_t C1FIFOCON31bits __asm__ ("C1FIFOCON31") __attribute__((section("sfrs"), address(0xBF880B10)));
extern volatile uint32_t        C1FIFOCON31CLR __attribute__((section("sfrs"),address(0xBF880B14)));
extern volatile uint32_t        C1FIFOCON31SET __attribute__((section("sfrs"),address(0xBF880B18)));
extern volatile uint32_t        C1FIFOCON31INV __attribute__((section("sfrs"),address(0xBF880B1C)));
#define C1FIFOINT31 C1FIFOINT31
extern volatile uint32_t   C1FIFOINT31 __attribute__((section("sfrs"), address(0xBF880B20)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT31bits_t;
extern volatile __C1FIFOINT31bits_t C1FIFOINT31bits __asm__ ("C1FIFOINT31") __attribute__((section("sfrs"), address(0xBF880B20)));
extern volatile uint32_t        C1FIFOINT31CLR __attribute__((section("sfrs"),address(0xBF880B24)));
extern volatile uint32_t        C1FIFOINT31SET __attribute__((section("sfrs"),address(0xBF880B28)));
extern volatile uint32_t        C1FIFOINT31INV __attribute__((section("sfrs"),address(0xBF880B2C)));
#define C1FIFOUA31 C1FIFOUA31
extern volatile uint32_t   C1FIFOUA31 __attribute__((section("sfrs"), address(0xBF880B30)));
extern volatile uint32_t        C1FIFOUA31CLR __attribute__((section("sfrs"),address(0xBF880B34)));
extern volatile uint32_t        C1FIFOUA31SET __attribute__((section("sfrs"),address(0xBF880B38)));
extern volatile uint32_t        C1FIFOUA31INV __attribute__((section("sfrs"),address(0xBF880B3C)));
#define C1FIFOCI31 C1FIFOCI31
extern volatile uint32_t   C1FIFOCI31 __attribute__((section("sfrs"), address(0xBF880B40)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI31bits_t;
extern volatile __C1FIFOCI31bits_t C1FIFOCI31bits __asm__ ("C1FIFOCI31") __attribute__((section("sfrs"), address(0xBF880B40)));
extern volatile uint32_t        C1FIFOCI31CLR __attribute__((section("sfrs"),address(0xBF880B44)));
extern volatile uint32_t        C1FIFOCI31SET __attribute__((section("sfrs"),address(0xBF880B48)));
extern volatile uint32_t        C1FIFOCI31INV __attribute__((section("sfrs"),address(0xBF880B4C)));
#define C2CON C2CON
extern volatile uint32_t   C2CON __attribute__((section("sfrs"), address(0xBF881000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t :6;
    uint32_t CANBUSY:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :4;
    uint32_t CANCAP:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2CONbits_t;
extern volatile __C2CONbits_t C2CONbits __asm__ ("C2CON") __attribute__((section("sfrs"), address(0xBF881000)));
extern volatile uint32_t        C2CONCLR __attribute__((section("sfrs"),address(0xBF881004)));
extern volatile uint32_t        C2CONSET __attribute__((section("sfrs"),address(0xBF881008)));
extern volatile uint32_t        C2CONINV __attribute__((section("sfrs"),address(0xBF88100C)));
#define C2CFG C2CFG
extern volatile uint32_t   C2CFG __attribute__((section("sfrs"), address(0xBF881010)));
typedef union {
  struct {
    uint32_t BRP:6;
    uint32_t SJW:2;
    uint32_t PRSEG:3;
    uint32_t SEG1PH:3;
    uint32_t SAM:1;
    uint32_t SEG2PHTS:1;
    uint32_t SEG2PH:3;
    uint32_t :3;
    uint32_t WAKFIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2CFGbits_t;
